; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=303, out_folder=./training, instance_id=61, seed=2085, goal_proportion=0.03

(define (problem blocksworld-61)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 - object)
 (:init 
    (arm-empty)
    (clear b165)
    (on b165 b206)
    (on b206 b77)
    (on-table b77)
    (clear b199)
    (on b199 b184)
    (on b184 b125)
    (on b125 b293)
    (on b293 b99)
    (on b99 b79)
    (on-table b79)
    (clear b194)
    (on b194 b189)
    (on-table b189)
    (clear b260)
    (on b260 b222)
    (on b222 b170)
    (on b170 b114)
    (on-table b114)
    (clear b240)
    (on b240 b69)
    (on b69 b151)
    (on b151 b217)
    (on b217 b105)
    (on b105 b159)
    (on b159 b61)
    (on-table b61)
    (clear b201)
    (on b201 b100)
    (on b100 b111)
    (on b111 b143)
    (on b143 b147)
    (on b147 b116)
    (on b116 b245)
    (on-table b245)
    (clear b279)
    (on b279 b270)
    (on b270 b42)
    (on-table b42)
    (clear b269)
    (on b269 b223)
    (on b223 b121)
    (on b121 b246)
    (on b246 b82)
    (on-table b82)
    (clear b283)
    (on b283 b166)
    (on b166 b179)
    (on-table b179)
    (clear b156)
    (on b156 b9)
    (on b9 b234)
    (on-table b234)
    (clear b205)
    (on b205 b63)
    (on b63 b271)
    (on b271 b275)
    (on-table b275)
    (clear b290)
    (on b290 b173)
    (on b173 b58)
    (on b58 b181)
    (on b181 b75)
    (on-table b75)
    (clear b276)
    (on b276 b115)
    (on b115 b233)
    (on b233 b28)
    (on b28 b235)
    (on-table b235)
    (clear b94)
    (on b94 b149)
    (on b149 b197)
    (on-table b197)
    (clear b286)
    (on-table b286)
    (clear b280)
    (on b280 b80)
    (on b80 b18)
    (on b18 b129)
    (on-table b129)
    (clear b137)
    (on b137 b70)
    (on b70 b157)
    (on b157 b96)
    (on b96 b203)
    (on b203 b50)
    (on-table b50)
    (clear b186)
    (on b186 b13)
    (on b13 b224)
    (on b224 b7)
    (on b7 b253)
    (on b253 b4)
    (on-table b4)
    (clear b282)
    (on-table b282)
    (clear b267)
    (on-table b267)
    (clear b132)
    (on b132 b52)
    (on b52 b39)
    (on b39 b146)
    (on b146 b97)
    (on-table b97)
    (clear b72)
    (on-table b72)
    (clear b40)
    (on b40 b219)
    (on b219 b162)
    (on b162 b90)
    (on b90 b59)
    (on b59 b107)
    (on b107 b120)
    (on b120 b131)
    (on b131 b141)
    (on-table b141)
    (clear b252)
    (on b252 b273)
    (on b273 b25)
    (on b25 b88)
    (on b88 b56)
    (on b56 b2)
    (on b2 b24)
    (on-table b24)
    (clear b37)
    (on b37 b209)
    (on-table b209)
    (clear b48)
    (on b48 b161)
    (on b161 b118)
    (on-table b118)
    (clear b182)
    (on b182 b230)
    (on b230 b152)
    (on b152 b31)
    (on b31 b133)
    (on b133 b274)
    (on b274 b177)
    (on b177 b249)
    (on b249 b46)
    (on b46 b71)
    (on-table b71)
    (clear b76)
    (on-table b76)
    (clear b73)
    (on b73 b216)
    (on b216 b183)
    (on b183 b244)
    (on b244 b68)
    (on b68 b266)
    (on b266 b12)
    (on-table b12)
    (clear b214)
    (on b214 b101)
    (on b101 b238)
    (on b238 b8)
    (on b8 b67)
    (on-table b67)
    (clear b256)
    (on-table b256)
    (clear b210)
    (on-table b210)
    (clear b27)
    (on b27 b231)
    (on b231 b254)
    (on b254 b242)
    (on-table b242)
    (clear b263)
    (on b263 b291)
    (on b291 b66)
    (on b66 b136)
    (on-table b136)
    (clear b285)
    (on b285 b64)
    (on b64 b29)
    (on b29 b284)
    (on-table b284)
    (clear b3)
    (on b3 b248)
    (on b248 b144)
    (on b144 b38)
    (on-table b38)
    (clear b202)
    (on b202 b227)
    (on b227 b213)
    (on b213 b255)
    (on b255 b299)
    (on b299 b294)
    (on b294 b277)
    (on b277 b158)
    (on b158 b26)
    (on b26 b169)
    (on b169 b160)
    (on b160 b289)
    (on-table b289)
    (clear b98)
    (on b98 b153)
    (on b153 b130)
    (on b130 b193)
    (on b193 b229)
    (on-table b229)
    (clear b236)
    (on b236 b44)
    (on b44 b53)
    (on-table b53)
    (clear b180)
    (on-table b180)
    (clear b211)
    (on-table b211)
    (clear b145)
    (on b145 b300)
    (on-table b300)
    (clear b122)
    (on-table b122)
    (clear b35)
    (on b35 b134)
    (on b134 b250)
    (on b250 b187)
    (on b187 b11)
    (on b11 b262)
    (on-table b262)
    (clear b95)
    (on b95 b176)
    (on b176 b208)
    (on b208 b171)
    (on b171 b298)
    (on-table b298)
    (clear b167)
    (on b167 b91)
    (on-table b91)
    (clear b20)
    (on b20 b16)
    (on-table b16)
    (clear b85)
    (on-table b85)
    (clear b81)
    (on b81 b83)
    (on-table b83)
    (clear b150)
    (on-table b150)
    (clear b124)
    (on b124 b281)
    (on b281 b108)
    (on b108 b93)
    (on-table b93)
    (clear b232)
    (on b232 b198)
    (on b198 b239)
    (on b239 b287)
    (on b287 b123)
    (on-table b123)
    (clear b172)
    (on-table b172)
    (clear b6)
    (on b6 b15)
    (on b15 b264)
    (on b264 b251)
    (on b251 b138)
    (on-table b138)
    (clear b261)
    (on b261 b54)
    (on-table b54)
    (clear b191)
    (on b191 b218)
    (on b218 b65)
    (on b65 b188)
    (on b188 b272)
    (on b272 b295)
    (on b295 b303)
    (on b303 b45)
    (on-table b45)
    (clear b292)
    (on b292 b237)
    (on b237 b168)
    (on b168 b296)
    (on b296 b140)
    (on b140 b84)
    (on b84 b268)
    (on b268 b301)
    (on b301 b212)
    (on b212 b163)
    (on b163 b164)
    (on-table b164)
    (clear b1)
    (on-table b1)
    (clear b49)
    (on b49 b258)
    (on b258 b178)
    (on b178 b78)
    (on b78 b30)
    (on-table b30)
    (clear b174)
    (on b174 b127)
    (on b127 b36)
    (on b36 b62)
    (on-table b62)
    (clear b126)
    (on b126 b14)
    (on b14 b104)
    (on b104 b195)
    (on b195 b215)
    (on b215 b220)
    (on b220 b225)
    (on b225 b113)
    (on b113 b110)
    (on-table b110)
    (clear b21)
    (on b21 b278)
    (on-table b278)
    (clear b142)
    (on b142 b175)
    (on b175 b43)
    (on b43 b74)
    (on b74 b241)
    (on b241 b139)
    (on-table b139)
    (clear b200)
    (on b200 b192)
    (on b192 b109)
    (on-table b109)
    (clear b154)
    (on b154 b228)
    (on b228 b247)
    (on b247 b17)
    (on-table b17)
    (clear b207)
    (on b207 b302)
    (on b302 b103)
    (on b103 b33)
    (on-table b33)
    (clear b297)
    (on b297 b60)
    (on b60 b204)
    (on b204 b185)
    (on b185 b190)
    (on b190 b196)
    (on b196 b23)
    (on b23 b5)
    (on b5 b117)
    (on b117 b10)
    (on b10 b128)
    (on-table b128)
    (clear b288)
    (on b288 b112)
    (on b112 b259)
    (on-table b259)
    (clear b257)
    (on b257 b243)
    (on b243 b34)
    (on b34 b265)
    (on-table b265)
    (clear b57)
    (on b57 b155)
    (on b155 b41)
    (on-table b41)
    (clear b226)
    (on-table b226)
    (clear b148)
    (on b148 b51)
    (on b51 b86)
    (on b86 b106)
    (on b106 b221)
    (on b221 b135)
    (on b135 b55)
    (on b55 b89)
    (on b89 b92)
    (on b92 b19)
    (on b19 b32)
    (on b32 b22)
    (on-table b22)
    (clear b102)
    (on b102 b119)
    (on-table b119)
    (clear b87)
    (on b87 b47)
    (on-table b47))
 (:goal  (and 
    (clear b8)
    (on b8 b1)
    (on-table b1)
    (clear b6)
    (on b6 b3)
    (on b3 b2)
    (on-table b2)
    (clear b4)
    (on b4 b5)
    (on b5 b9)
    (on b9 b7)
    (on-table b7))))

; plan
1. (unstack b156 b9)
   deleted: (on b156 b9) (clear b156) (arm-empty)
   added: (holding b156) (clear b9)
   goals met: 2 of 12
2. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 2 of 12
3. (unstack b186 b13)
   deleted: (on b186 b13) (clear b186) (arm-empty)
   added: (holding b186) (clear b13)
   goals met: 2 of 12
4. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 2 of 12
5. (unstack b13 b224)
   deleted: (on b13 b224) (clear b13) (arm-empty)
   added: (holding b13) (clear b224)
   goals met: 2 of 12
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 12
7. (unstack b214 b101)
   deleted: (on b214 b101) (clear b214) (arm-empty)
   added: (holding b214) (clear b101)
   goals met: 2 of 12
8. (putdown b214)
   deleted: (holding b214)
   added: (clear b214) (arm-empty) (on-table b214)
   goals met: 2 of 12
9. (unstack b101 b238)
   deleted: (on b101 b238) (clear b101) (arm-empty)
   added: (holding b101) (clear b238)
   goals met: 2 of 12
10. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 2 of 12
11. (unstack b224 b7)
   deleted: (on b224 b7) (clear b224) (arm-empty)
   added: (holding b224) (clear b7)
   goals met: 2 of 12
12. (putdown b224)
   deleted: (holding b224)
   added: (clear b224) (arm-empty) (on-table b224)
   goals met: 2 of 12
13. (unstack b7 b253)
   deleted: (on b7 b253) (clear b7) (arm-empty)
   added: (holding b7) (clear b253)
   goals met: 2 of 12
14. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 12
15. (unstack b238 b8)
   deleted: (on b238 b8) (clear b238) (arm-empty)
   added: (holding b238) (clear b8)
   goals met: 4 of 12
16. (putdown b238)
   deleted: (holding b238)
   added: (clear b238) (arm-empty) (on-table b238)
   goals met: 4 of 12
17. (unstack b252 b273)
   deleted: (on b252 b273) (clear b252) (arm-empty)
   added: (holding b252) (clear b273)
   goals met: 4 of 12
18. (putdown b252)
   deleted: (holding b252)
   added: (clear b252) (arm-empty) (on-table b252)
   goals met: 4 of 12
19. (unstack b253 b4)
   deleted: (on b253 b4) (clear b253) (arm-empty)
   added: (holding b253) (clear b4)
   goals met: 5 of 12
20. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 5 of 12
21. (unstack b273 b25)
   deleted: (on b273 b25) (clear b273) (arm-empty)
   added: (holding b273) (clear b25)
   goals met: 5 of 12
22. (putdown b273)
   deleted: (holding b273)
   added: (clear b273) (arm-empty) (on-table b273)
   goals met: 5 of 12
23. (unstack b25 b88)
   deleted: (on b25 b88) (clear b25) (arm-empty)
   added: (holding b25) (clear b88)
   goals met: 5 of 12
24. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 5 of 12
25. (unstack b297 b60)
   deleted: (on b297 b60) (clear b297) (arm-empty)
   added: (holding b297) (clear b60)
   goals met: 5 of 12
26. (putdown b297)
   deleted: (holding b297)
   added: (clear b297) (arm-empty) (on-table b297)
   goals met: 5 of 12
27. (unstack b60 b204)
   deleted: (on b60 b204) (clear b60) (arm-empty)
   added: (holding b60) (clear b204)
   goals met: 5 of 12
28. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 5 of 12
29. (unstack b204 b185)
   deleted: (on b204 b185) (clear b204) (arm-empty)
   added: (holding b204) (clear b185)
   goals met: 5 of 12
30. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 5 of 12
31. (unstack b185 b190)
   deleted: (on b185 b190) (clear b185) (arm-empty)
   added: (holding b185) (clear b190)
   goals met: 5 of 12
32. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 5 of 12
33. (unstack b190 b196)
   deleted: (on b190 b196) (clear b190) (arm-empty)
   added: (holding b190) (clear b196)
   goals met: 5 of 12
34. (putdown b190)
   deleted: (holding b190)
   added: (clear b190) (arm-empty) (on-table b190)
   goals met: 5 of 12
35. (unstack b196 b23)
   deleted: (on b196 b23) (clear b196) (arm-empty)
   added: (holding b196) (clear b23)
   goals met: 5 of 12
36. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 5 of 12
37. (unstack b23 b5)
   deleted: (on b23 b5) (clear b23) (arm-empty)
   added: (holding b23) (clear b5)
   goals met: 5 of 12
38. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 5 of 12
39. (unstack b88 b56)
   deleted: (on b88 b56) (clear b88) (arm-empty)
   added: (holding b88) (clear b56)
   goals met: 5 of 12
40. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 5 of 12
41. (unstack b56 b2)
   deleted: (on b56 b2) (clear b56) (arm-empty)
   added: (holding b56) (clear b2)
   goals met: 5 of 12
42. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 5 of 12
43. (unstack b2 b24)
   deleted: (on b2 b24) (clear b2) (arm-empty)
   added: (holding b2) (clear b24)
   goals met: 5 of 12
44. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 12
45. (unstack b3 b248)
   deleted: (on b3 b248) (clear b3) (arm-empty)
   added: (holding b3) (clear b248)
   goals met: 6 of 12
46. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 7 of 12
47. (unstack b5 b117)
   deleted: (on b5 b117) (clear b5) (arm-empty)
   added: (holding b5) (clear b117)
   goals met: 7 of 12
48. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 8 of 12
49. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 12
50. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 9 of 12
51. (unstack b6 b15)
   deleted: (on b6 b15) (clear b6) (arm-empty)
   added: (holding b6) (clear b15)
   goals met: 8 of 12
52. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 10 of 12
53. (unstack b8 b67)
   deleted: (on b8 b67) (clear b8) (arm-empty)
   added: (holding b8) (clear b67)
   goals met: 9 of 12
54. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 11 of 12
55. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 9 of 12
56. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 12
57. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 9 of 12
58. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 9 of 12
59. (unstack b9 b234)
   deleted: (on b9 b234) (clear b9) (arm-empty)
   added: (holding b9) (clear b234)
   goals met: 9 of 12
60. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 10 of 12
61. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 12
62. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 11 of 12
63. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 12
64. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 12 of 12
